In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame(
    {'nombres':['Juan','Ronald','Carla','Nuria','Jose','Deni',None],
     'edades':[35,36,28,19,25,'No te lo digo',None],
     'dinero':[1000,5000,500,1_000_000,'anda a lavarte','case un millon',None],
     'soy Nuria':[False,False,False,True,False,False,None]}
)

df

  nombres         edades          dinero soy Nuria
0    Juan             35            1000     False
1  Ronald             36            5000     False
2   Carla             28             500     False
3   Nuria             19         1000000      True
4    Jose             25  anda a lavarte     False
5    Deni  No te lo digo  case un millon     False
6    None           None            None      None

# Analizar los datos

In [13]:
df.size

28

In [14]:
df.shape

(7, 4)

In [15]:
df.columns

Index(['nombres', 'edades', 'dinero', 'soy Nuria'], dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     6 non-null      object
 3   soy Nuria  6 non-null      object
dtypes: object(4)
memory usage: 356.0+ bytes

In [11]:
df.describe()

       nombres  edades  dinero soy Nuria
count        6       6       6         6
unique       6       6       6         2
top       Juan      35    1000     False
freq         1       1       1         5